LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Transfer.cpp
/*
 * ESP8266mDNS Transfer.cpp
 *
 *  License (MIT license):
 *    Permission is hereby granted, free of charge, to any person obtaining a copy
 *    of this software and associated documentation files (the "Software"), to deal
 *    in the Software without restriction, including without limitation the rights
 *    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 *    copies of the Software, and to permit persons to whom the Software is
 *    furnished to do so, subject to the following conditions:
 *
 *    The above copyright notice and this permission notice shall be included in
 *    all copies or substantial portions of the Software.
 *
 *    THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 *    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 *    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 *    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 *    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 *    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 *    THE SOFTWARE.
 *
 */

extern "C" {
    #include "user_interface.h"
}

#include "lwip/prot/dns.h"  // DNS_RRTYPE_xxx, DNS_MQUERY_PORT

//#include "../LEADump/LEADump.h"

#include "ESP8266mDNS-Priv.h"


/*
 * namespace LEA_MDNSResponder
 */
namespace LEA_MDNSResponder {

/**
 *  CONST STRINGS
 */
static const char*                      scpcLocal               = "local";
static const char*                      scpcServices            = "services";
static const char*                      scpcDNSSD               = "dns-sd";
static const char*                      scpcUDP                 = "udp";
//static const char*                    scpcTCP                 = "tcp";

#ifdef MDNS_IP4_SUPPORT
    static const char*                  scpcReverseIP4Domain    = "in-addr";
#endif
#ifdef MDNS_IP6_SUPPORT
    static const char*                  scpcReverseIP6Domain    = "ip6";
#endif
static const char*                      scpcReverseTopDomain    = "arpa";

/**
 * TRANSFER
 */


/**
 * SENDING
 */

/*
 * MDNSResponder::_sendMDNSMessage
 *
 * Unicast responses are prepared and sent directly to the querier.
 * Multicast responses or queries are transferred to _sendMDNSMessage_Multicast
 *
 * Any reply flags in installed services are removed at the end!
 *
 */
bool MDNSResponder::_sendMDNSMessage(MDNSResponder::stcMDNSSendParameter& p_rSendParameter) {
    
    bool    bResult = true;
    
    if (p_rSendParameter.m_bResponse) {
        if (p_rSendParameter.m_bUnicast) {  // Unicast response  -> Send to querier
            DEBUG_EX_ERR(if (!m_pUDPContext->getRemoteAddress()) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _sendMDNSMessage: MISSING remote address for response!\n")); });
            ip_addr_t   ipRemote;
            ipRemote.addr = m_pUDPContext->getRemoteAddress();
            bResult = ((_prepareMDNSMessage(p_rSendParameter, _getResponseMulticastInterface(SOFTAP_MODE | STATION_MODE))) &&
                       (m_pUDPContext->send(&ipRemote, m_pUDPContext->getRemotePort())));
        }
        else {                              // Multicast response -> Send via the same network interface, that received the query
            bResult = _sendMDNSMessage_Multicast(p_rSendParameter, (SOFTAP_MODE | STATION_MODE));
        }
    }
    else {                                  // Multicast query -> Send by all available network interfaces
        const int   caiWiFiOpModes[2] = { SOFTAP_MODE, STATION_MODE };
        for (int iInterfaceId=0; ((bResult) && (iInterfaceId<=1)); ++iInterfaceId) {
            if (wifi_get_opmode() & caiWiFiOpModes[iInterfaceId]) {
                bResult = _sendMDNSMessage_Multicast(p_rSendParameter, caiWiFiOpModes[iInterfaceId]);
            }
        }
    }

    // Finally clear service reply masks
    for (stcMDNSService* pService=m_pServices; pService; pService=pService->m_pNext) {
        pService->m_u8ReplyMask = 0;
    }

    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _sendMDNSMessage: FAILED!\n")); });
    return bResult;
}

/*
 * MDNSResponder::_sendMDNSMessage_Multicast
 *
 * Fills the UDP output buffer (via _prepareMDNSMessage) and sends the buffer
 * via the selected WiFi interface (Station or AP)
 */
bool MDNSResponder::_sendMDNSMessage_Multicast(MDNSResponder::stcMDNSSendParameter& p_rSendParameter,
                                               int p_iWiFiOpMode) {
    bool    bResult = false;

    ip_addr_t   ifFromAddress;
    ifFromAddress.addr = _getResponseMulticastInterface(p_iWiFiOpMode);
    IPAddress   fromIPAddress(ifFromAddress.addr);
    m_pUDPContext->setMulticastInterface(ifFromAddress);

    ip_addr_t   toMulticastAddress;
#ifdef MDNS_IP4_SUPPORT
    toMulticastAddress.addr = DNS_MQUERY_IPV4_GROUP_INIT;
#endif
#ifdef MDNS_IP6_SUPPORT
    //TODO: set multicast address
    toMulticastAddress.addr = DNS_MQUERY_IPV6_GROUP_INIT;
#endif
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _sendMDNSMessage_Multicast: Will send to '%s'.\n"), IPAddress(toMulticastAddress.addr).toString().c_str()););
    bResult = ((_prepareMDNSMessage(p_rSendParameter, fromIPAddress)) &&
               (m_pUDPContext->send(&toMulticastAddress, DNS_MQUERY_PORT)));

    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _sendMDNSMessage_Multicast: FAILED!\n")); });
    return bResult;
}

/*
 * MDNSResponder::_prepareMDNSMessage
 *
 * The MDNS message is composed in a two-step process.
 * In the first loop 'only' the header informations (mainly number of answers) are collected,
 * while in the seconds loop, the header and all queries and answers are written to the UDP
 * output buffer.
 *
 */
bool MDNSResponder::_prepareMDNSMessage(MDNSResponder::stcMDNSSendParameter& p_rSendParameter,
                                        IPAddress p_IPAddress) {
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _prepareMDNSMessage\n")););
    bool    bResult = true;
    
    // Prepare header; count answers
    _stcMDNS_MsgHeader  msgHeader(0, p_rSendParameter.m_bResponse, 0, p_rSendParameter.m_bAuthorative);
    // If this is a response, the answers are anwers,
    // else this is a query or probe and the answers go into auth section
    uint16_t&           ru16Answers = (p_rSendParameter.m_bResponse
                                        ? msgHeader.m_u16ANCount
                                        : msgHeader.m_u16NSCount);
    
    /**
     * enuSequence
     */
    enum enuSequence {
        Sequence_Count  = 0,
        Sequence_Send   = 1
    };
    
    // Two step sequence: 'Count' and 'Send'
    for (uint32_t sequence=Sequence_Count; ((bResult) && (sequence<=Sequence_Send)); ++sequence) {
        DEBUG_EX_INFO(
            if (Sequence_Send == sequence) {
                DEBUG_OUTPUT.printf(F("[MDNSResponder] _prepareMDNSMessage: ID:%u QR:%u OP:%u AA:%u TC:%u RD:%u RA:%u R:%u QD:%u AN:%u NS:%u AR:%u\n"),
                (unsigned)msgHeader.m_u16ID,
                (unsigned)msgHeader.m_1bQR, (unsigned)msgHeader.m_4bOpcode, (unsigned)msgHeader.m_1bAA, (unsigned)msgHeader.m_1bTC, (unsigned)msgHeader.m_1bRD,
                (unsigned)msgHeader.m_1bRA, (unsigned)msgHeader.m_4bRCode,
                (unsigned)msgHeader.m_u16QDCount,
                (unsigned)msgHeader.m_u16ANCount,
                (unsigned)msgHeader.m_u16NSCount,
                (unsigned)msgHeader.m_u16ARCount);
            }
        );
        // Count/send
        // Header
        bResult = ((Sequence_Count == sequence)
                    ? true
                    : _writeMDNSMsgHeader(msgHeader, p_rSendParameter));
        DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _prepareMDNSMessage: _writeMDNSMsgHeader FAILED!\n")););
        // Questions
        for (stcMDNS_RRQuestion* pQuestion=p_rSendParameter.m_pQuestions; ((bResult) && (pQuestion)); pQuestion=pQuestion->m_pNext) {
            ((Sequence_Count == sequence)
                ? ++msgHeader.m_u16QDCount
                : (bResult = _writeMDNSQuestion(*pQuestion, p_rSendParameter)));
            DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _prepareMDNSMessage: _writeMDNSQuestion FAILED!\n")););
        }

        // Answers and authorative answers
#ifdef MDNS_IP4_SUPPORT
        if ((bResult) &&
            (p_rSendParameter.m_u8HostReplyMask & ContentFlag_A)) {
            ((Sequence_Count == sequence)
                ? ++ru16Answers
                : (bResult = _writeMDNSAnswer_A(p_IPAddress, p_rSendParameter)));
            DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _prepareMDNSMessage: _writeMDNSAnswer_A(A) FAILED!\n")););
        }
        if ((bResult) &&
            (p_rSendParameter.m_u8HostReplyMask & ContentFlag_PTR_IP4)) {
            ((Sequence_Count == sequence)
                ? ++ru16Answers
                : (bResult = _writeMDNSAnswer_PTR_IP4(p_IPAddress, p_rSendParameter)));
            DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _prepareMDNSMessage: _writeMDNSAnswer_PTR_IP4 FAILED!\n")););
        }
#endif
#ifdef MDNS_IP6_SUPPORT
        if ((bResult) &&
            (p_rSendParameter.m_u8HostReplyMask & ContentFlag_AAAA)) {
            ((Sequence_Count == sequence)
                ? ++ru16Answers
                : (bResult = _writeMDNSAnswer_AAAA(p_IPAddress, p_rSendParameter)));
            DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _prepareMDNSMessage: _writeMDNSAnswer_AAAA(A) FAILED!\n")););
        }
        if ((bResult) &&
            (p_rSendParameter.m_u8HostReplyMask & ContentFlag_PTR_IP6)) {
            ((Sequence_Count == sequence)
                ? ++ru16Answers
                : (bResult = _writeMDNSAnswer_PTR_IP6(p_IPAddress, p_rSendParameter)));
            DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _prepareMDNSMessage: _writeMDNSAnswer_PTR_IP6 FAILED!\n")););
        }
#endif

        for (stcMDNSService* pService=m_pServices; ((bResult) && (pService)); pService=pService->m_pNext) {
            if ((bResult) &&
                (pService->m_u8ReplyMask & ContentFlag_PTR_TYPE)) {
                ((Sequence_Count == sequence)
                    ? ++ru16Answers
                    : (bResult = _writeMDNSAnswer_PTR_TYPE(*pService, p_rSendParameter)));
                DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _prepareMDNSMessage: _writeMDNSAnswer_PTR_TYPE FAILED!\n")););
            }
            if ((bResult) &&
                (pService->m_u8ReplyMask & ContentFlag_PTR_NAME)) {
                ((Sequence_Count == sequence)
                    ? ++ru16Answers
                    : (bResult = _writeMDNSAnswer_PTR_NAME(*pService, p_rSendParameter)));
                DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _prepareMDNSMessage: _writeMDNSAnswer_PTR_NAME FAILED!\n")););
            }
            if ((bResult) &&
                (pService->m_u8ReplyMask & ContentFlag_SRV)) {
                ((Sequence_Count == sequence)
                    ? ++ru16Answers
                    : (bResult = _writeMDNSAnswer_SRV(*pService, p_rSendParameter)));
                DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _prepareMDNSMessage: _writeMDNSAnswer_SRV(A) FAILED!\n")););
            }
            if ((bResult) &&
                (pService->m_u8ReplyMask & ContentFlag_TXT)) {
                ((Sequence_Count == sequence)
                    ? ++ru16Answers
                    : (bResult = _writeMDNSAnswer_TXT(*pService, p_rSendParameter)));
                DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _prepareMDNSMessage: _writeMDNSAnswer_TXT(A) FAILED!\n")););
            }
        }   // for services
        
