LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Transfer.cpp
        // Additional answers
#ifdef MDNS_IP4_SUPPORT
        bool    bNeedsAdditionalAnswerA = false;
#endif
#ifdef MDNS_IP6_SUPPORT
        bool    bNeedsAdditionalAnswerAAAA = false;
#endif
        for (stcMDNSService* pService=m_pServices; ((bResult) && (pService)); pService=pService->m_pNext) {
            if ((bResult) &&
                (pService->m_u8ReplyMask & ContentFlag_PTR_NAME) && // If PTR_NAME is requested, AND
                (!(pService->m_u8ReplyMask & ContentFlag_SRV))) {   // NOT SRV -> add SRV as additional answer
                ((Sequence_Count == sequence)
                    ? ++msgHeader.m_u16ARCount
                    : (bResult = _writeMDNSAnswer_SRV(*pService, p_rSendParameter)));
                DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _prepareMDNSMessage: _writeMDNSAnswer_SRV(B) FAILED!\n")););
            }
            if ((bResult) &&
                (pService->m_u8ReplyMask & ContentFlag_PTR_NAME) && // If PTR_NAME is requested, AND
                (!(pService->m_u8ReplyMask & ContentFlag_TXT))) {   // NOT TXT -> add TXT as additional answer
                ((Sequence_Count == sequence)
                    ? ++msgHeader.m_u16ARCount
                    : (bResult = _writeMDNSAnswer_TXT(*pService, p_rSendParameter)));
                DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _prepareMDNSMessage: _writeMDNSAnswer_TXT(B) FAILED!\n")););
            }
            if ((pService->m_u8ReplyMask & (ContentFlag_PTR_NAME | ContentFlag_SRV)) ||         // If service instance name or SRV OR
                (p_rSendParameter.m_u8HostReplyMask & (ContentFlag_A | ContentFlag_AAAA))) {    // any host IP address is requested
#ifdef MDNS_IP4_SUPPORT
                if ((bResult) &&
                    (!(p_rSendParameter.m_u8HostReplyMask & ContentFlag_A))) {          // Add IP4 address
                    bNeedsAdditionalAnswerA = true;
                }
#endif
#ifdef MDNS_IP6_SUPPORT
                if ((bResult) &&
                    (!(p_rSendParameter.m_u8HostReplyMask & ContentFlag_AAAA))) {       // Add IP6 address
                    bNeedsAdditionalAnswerAAAA = true;
                }
#endif
            }
        }   // for services
        
        // Answer A needed?
#ifdef MDNS_IP4_SUPPORT
        if ((bResult) &&
            (bNeedsAdditionalAnswerA)) {
            ((Sequence_Count == sequence)
                ? ++msgHeader.m_u16ARCount
                : (bResult = _writeMDNSAnswer_A(p_IPAddress, p_rSendParameter)));
            DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _prepareMDNSMessage: _writeMDNSAnswer_A(B) FAILED!\n")););
        }
#endif
#ifdef MDNS_IP6_SUPPORT
        // Answer AAAA needed?
        if ((bResult) &&
            (bNeedsAdditionalAnswerAAAA)) {
            ((Sequence_Count == sequence)
                ? ++msgHeader.m_u16ARCount
                : (bResult = _writeMDNSAnswer_AAAA(p_IPAddress, p_rSendParameter)));
            DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _prepareMDNSMessage: _writeMDNSAnswer_AAAA(B) FAILED!\n")););
        }
#endif
        DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _prepareMDNSMessage: Loop %i FAILED!\n"), sequence););
    }   // for sequence
    DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _prepareMDNSMessage: FAILED!\n")););
    return bResult;
}

/*
 * MDNSResponder::_sendMDNSServiceQuery
 *
 * Creates and sends a PTR query for the given service domain.
 *
 */
bool MDNSResponder::_sendMDNSServiceQuery(const MDNSResponder::stcMDNSServiceQuery& p_ServiceQuery) {

    return _sendMDNSQuery(p_ServiceQuery.m_ServiceTypeDomain, DNS_RRTYPE_PTR);
}

/*
 * MDNSResponder::_sendMDNSQuery
 *
 * Creates and sends a query for the given domain and query type.
 *
 */
bool MDNSResponder::_sendMDNSQuery(const MDNSResponder::stcMDNS_RRDomain& p_QueryDomain,
                                   uint16_t p_u16QueryType) {

    bool                    bResult = false;
    
    stcMDNSSendParameter    sendParameter;
    if (0 != ((sendParameter.m_pQuestions = new stcMDNS_RRQuestion))) {
        sendParameter.m_pQuestions->m_Header.m_Domain = p_QueryDomain;

        sendParameter.m_pQuestions->m_bUnicast = true;
        sendParameter.m_pQuestions->m_Header.m_Attributes.m_u16Type = p_u16QueryType;
        sendParameter.m_pQuestions->m_Header.m_Attributes.m_u16Class = (0x8000 | DNS_RRCLASS_IN);   // Unicast & INternet

        bResult = _sendMDNSMessage(sendParameter);
    }   // else: FAILED to alloc question
    DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _sendMDNSQuery: FAILED to alloc question!\n")););
    return bResult;
}

/*
 * MDNSResponder::_getResponseMulticastInterface
 *
 * Selects the appropriate interface for responses.
 * If AP mode is enabled and the remote contact is in the APs local net, then the
 * AP interface is used to send the response.
 * Otherwise the Station interface (if available) is used.
 *
 */
IPAddress MDNSResponder::_getResponseMulticastInterface(int p_iWiFiOpModes) const {
    
    ip_info IPInfo_Local;
    bool    bFoundMatch = false;
    
    if ((p_iWiFiOpModes & SOFTAP_MODE) &&
        (wifi_get_opmode() & SOFTAP_MODE)) {
        //DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _getResponseMulticastInterface: SOFTAP_MODE\n")););
        // Get remote IP address
        ip_info IPInfo_Remote;
        IPInfo_Remote.ip.addr = m_pUDPContext->getRemoteAddress();
        // Get local (AP) IP address
        wifi_get_ip_info(SOFTAP_IF, &IPInfo_Local);
        
        if ((IPInfo_Local.ip.addr) &&                                                       // Has local AP IP address AND
            (ip_addr_netcmp(&IPInfo_Remote.ip, &IPInfo_Local.ip, &IPInfo_Local.netmask))) { // Remote address is in the same subnet as the AP
            bFoundMatch = true;
        }
    }
    if ((!bFoundMatch) &&
        (p_iWiFiOpModes & STATION_MODE) &&
        (wifi_get_opmode() & STATION_MODE)) {
        //DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _getResponseMulticastInterface: STATION_MODE\n")););
        // Get local (STATION) IP address
        wifi_get_ip_info(STATION_IF, &IPInfo_Local);
    }
    //DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _getResponseMulticastInterface(%i): %s\n"), p_iWiFiOpModes, IPAddress(IPInfo_Local.ip.addr).toString().c_str()););
    return IPAddress(IPInfo_Local.ip.addr);
}


/**
 * HELPERS
 */

/**
 * RESOURCE RECORDS
 */

