LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Transfer.cpp
/*
 * MDNSResponder::_readRRQuestion
 *
 * Reads a question (eg. MyESP._http._tcp.local ANY IN) from the UPD input buffer.
 *
 */
bool MDNSResponder::_readRRQuestion(MDNSResponder::stcMDNS_RRQuestion& p_rRRQuestion) {
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRQuestion\n")););
    
    bool    bResult = false;
    
    if ((bResult = _readRRHeader(p_rRRQuestion.m_Header))) {
        // Extract unicast flag from class field
        p_rRRQuestion.m_bUnicast = (p_rRRQuestion.m_Header.m_Attributes.m_u16Class & 0x8000);
        p_rRRQuestion.m_Header.m_Attributes.m_u16Class &= (~0x8000);

        DEBUG_EX_INFO(
                DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRQuestion "));
                _printRRDomain(p_rRRQuestion.m_Header.m_Domain);
                DEBUG_OUTPUT.printf(F(" Type:0x%04X Class:0x%04X %s\n"), (unsigned)p_rRRQuestion.m_Header.m_Attributes.m_u16Type, (unsigned)p_rRRQuestion.m_Header.m_Attributes.m_u16Class, (p_rRRQuestion.m_bUnicast ? "Unicast" : "Multicast"));
                );
    }
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRQuestion: FAILED!\n")); });
    return bResult;
}

/*
 * MDNSResponder::_readRRAnswer
 *
 * Reads an answer (eg. _http._tcp.local PTR OP TTL MyESP._http._tcp.local)
 * from the UDP input buffer.
 * After reading the domain and type info, the further processing of the answer
 * is transferred the answer specific reading functions.
 * Unknown answer types are processed by the generic answer reader (to remove them
 * from the input buffer).
 *
 */
bool MDNSResponder::_readRRAnswer(MDNSResponder::stcMDNS_RRAnswer*& p_rpRRAnswer) {
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRAnswer\n")););
    
    bool    bResult = false;
    
    stcMDNS_RRHeader    header;
    uint32_t            u32TTL;
    uint16_t            u16RDLength;
    if ((_readRRHeader(header)) &&
        (_udpRead32(u32TTL)) &&
        (_udpRead16(u16RDLength))) {

        DEBUG_EX_INFO(
                DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRAnswer: Reading 0x%04X answer (class:0x%04X, TTL:%u, RDLength:%u) for "), header.m_Attributes.m_u16Type, header.m_Attributes.m_u16Class, u32TTL, u16RDLength);
                _printRRDomain(header.m_Domain);
                DEBUG_OUTPUT.printf(F("\n"));
                );
        
        switch (header.m_Attributes.m_u16Type & (~0x8000)) {    // Topmost bit might carry 'cache flush' flag
#ifdef MDNS_IP4_SUPPORT
        case DNS_RRTYPE_A:
            p_rpRRAnswer = new stcMDNS_RRAnswerA(header, u32TTL);
            bResult = _readRRAnswerA(*(stcMDNS_RRAnswerA*&)p_rpRRAnswer, u16RDLength);
            break;
#endif
        case DNS_RRTYPE_PTR:
            p_rpRRAnswer = new stcMDNS_RRAnswerPTR(header, u32TTL);
            bResult = _readRRAnswerPTR(*(stcMDNS_RRAnswerPTR*&)p_rpRRAnswer, u16RDLength);
            break;
        case DNS_RRTYPE_TXT:
            p_rpRRAnswer = new stcMDNS_RRAnswerTXT(header, u32TTL);
            bResult = _readRRAnswerTXT(*(stcMDNS_RRAnswerTXT*&)p_rpRRAnswer, u16RDLength);
            break;
#ifdef MDNS_IP6_SUPPORT
        case DNS_RRTYPE_AAAA:
            p_rpRRAnswer = new stcMDNS_RRAnswerAAAA(header, u32TTL);
            bResult = _readRRAnswerAAAA(*(stcMDNS_RRAnswerAAAA*&)p_rpRRAnswer, u16RDLength);
            break;
#endif
        case DNS_RRTYPE_SRV:
            p_rpRRAnswer = new stcMDNS_RRAnswerSRV(header, u32TTL);
            bResult = _readRRAnswerSRV(*(stcMDNS_RRAnswerSRV*&)p_rpRRAnswer, u16RDLength);
            break;
        default:
            p_rpRRAnswer = new stcMDNS_RRAnswerGeneric(header, u32TTL);
            bResult = _readRRAnswerGeneric(*(stcMDNS_RRAnswerGeneric*&)p_rpRRAnswer, u16RDLength);
            break;
        }
        DEBUG_EX_INFO(
                if ((bResult) &&
                    (p_rpRRAnswer)) {
                    DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRAnswer: "));
                    _printRRDomain(p_rpRRAnswer->m_Header.m_Domain);
                    DEBUG_OUTPUT.printf(F(" Type:0x%04X Class:0x%04X TTL:%u, RDLength:%u "), p_rpRRAnswer->m_Header.m_Attributes.m_u16Type, p_rpRRAnswer->m_Header.m_Attributes.m_u16Class, p_rpRRAnswer->m_u32TTL, u16RDLength);
                    switch (header.m_Attributes.m_u16Type & (~0x8000)) {    // Topmost bit might carry 'cache flush' flag
#ifdef MDNS_IP4_SUPPORT
                    case DNS_RRTYPE_A:
                        DEBUG_OUTPUT.printf(F("A IP:%s"), ((stcMDNS_RRAnswerA*&)p_rpRRAnswer)->m_IPAddress.toString().c_str());
                        break;
#endif
                    case DNS_RRTYPE_PTR:
                        DEBUG_OUTPUT.printf(F("PTR "));
                        _printRRDomain(((stcMDNS_RRAnswerPTR*&)p_rpRRAnswer)->m_PTRDomain);
                        break;
                    case DNS_RRTYPE_TXT: {
                        size_t  stTxtLength = ((stcMDNS_RRAnswerTXT*&)p_rpRRAnswer)->m_Txts.c_strLength();
                        char*   pTxts = new char[stTxtLength];
                        if (pTxts) {
                            ((stcMDNS_RRAnswerTXT*&)p_rpRRAnswer)->m_Txts.c_str(pTxts);
                            DEBUG_OUTPUT.printf(F("TXT(%u) %s"), stTxtLength, pTxts);
                            delete[] pTxts;
                        }
                        break;
                    }
#ifdef MDNS_IP6_SUPPORT
                    case DNS_RRTYPE_AAAA:
                        DEBUG_OUTPUT.printf(F("AAAA IP:%s"), ((stcMDNS_RRAnswerA*&)p_rpRRAnswer)->m_IPAddress.toString().c_str());
                        break;
#endif
                    case DNS_RRTYPE_SRV:
                        DEBUG_OUTPUT.printf(F("SRV Port:%u "), ((stcMDNS_RRAnswerSRV*&)p_rpRRAnswer)->m_u16Port);
                        _printRRDomain(((stcMDNS_RRAnswerSRV*&)p_rpRRAnswer)->m_SRVDomain);
                        break;
                    default:
                        DEBUG_OUTPUT.printf(F("generic "));
                        break;
                    }
                    DEBUG_OUTPUT.printf(F("\n"));
                }
                else {
                    DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRAnswer: FAILED to read specific answer of type 0x%04X!\n"), p_rpRRAnswer->m_Header.m_Attributes.m_u16Type);
                }
        );  // DEBUG_EX_INFO
    }
    DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRAnswer: FAILED!\n")););
    return bResult;
}

#ifdef MDNS_IP4_SUPPORT
    /*
     * MDNSResponder::_readRRAnswerA
     */
    bool MDNSResponder::_readRRAnswerA(MDNSResponder::stcMDNS_RRAnswerA& p_rRRAnswerA,
                                       uint16_t p_u16RDLength) {
        
        uint32_t    u32IP4Address;
        bool        bResult = ((MDNS_IP4_SIZE == p_u16RDLength) &&
                               (_udpReadBuffer((unsigned char*)&u32IP4Address, MDNS_IP4_SIZE)) &&
                               ((p_rRRAnswerA.m_IPAddress = IPAddress(u32IP4Address))));
        DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRAnswerA: FAILED!\n")););
        return bResult;
    }
#endif

