LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Transfer.cpp
/*
 * MDNSResponder::_readRRAnswerPTR
 */
bool MDNSResponder::_readRRAnswerPTR(MDNSResponder::stcMDNS_RRAnswerPTR& p_rRRAnswerPTR,
                                     uint16_t p_u16RDLength) {
    
    bool    bResult = ((p_u16RDLength) &&
                       (_readRRDomain(p_rRRAnswerPTR.m_PTRDomain)));
    DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRAnswerPTR: FAILED!\n")););
    return bResult;
}

/*
 * MDNSResponder::_readRRAnswerTXT
 *
 * Read TXT items from a buffer like 4c#=15ff=20
 */
bool MDNSResponder::_readRRAnswerTXT(MDNSResponder::stcMDNS_RRAnswerTXT& p_rRRAnswerTXT,
                                     uint16_t p_u16RDLength) {
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRAnswerTXT: RDLength:%u\n"), p_u16RDLength););
    bool    bResult = true;
    
    p_rRRAnswerTXT.clear();
    if (p_u16RDLength) {
        bResult = false;
        
        unsigned char*  pucBuffer = new unsigned char[p_u16RDLength];
        if (pucBuffer) {
            if (_udpReadBuffer(pucBuffer, p_u16RDLength)) {
                bResult = true;
                
                const unsigned char*    pucCursor = pucBuffer;
                while ((pucCursor < (pucBuffer + p_u16RDLength)) &&
                       (bResult)) {
                    bResult = false;
                    
                    stcMDNSServiceTxt*      pTxt = 0;
                    unsigned char   ucLength = *pucCursor++;    // Length of the next txt item
                    if (ucLength) {
                        DEBUG_EX_INFO(
                                static char sacBuffer[64]; *sacBuffer = 0;
                                uint8_t u8MaxLength = ((ucLength > (sizeof(sacBuffer) - 1)) ? (sizeof(sacBuffer) - 1) : ucLength);
                                os_strncpy(sacBuffer, (const char*)pucCursor, u8MaxLength); sacBuffer[u8MaxLength] = 0;
                                DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRAnswerTXT: Item(%u): %s\n"), ucLength, sacBuffer);
                                );

                        unsigned char*  pucEqualSign = (unsigned char*)os_strchr((const char*)pucCursor, '=');  // Position of the '=' sign
                        unsigned char   ucKeyLength;
                        if ((pucEqualSign) &&
                            ((ucKeyLength = (pucEqualSign - pucCursor)))) {
                            unsigned char   ucValueLength = (ucLength - (pucEqualSign - pucCursor + 1));
                            bResult = (((pTxt = new stcMDNSServiceTxt)) &&
                                       (pTxt->setKey((const char*)pucCursor, ucKeyLength)) &&
                                       (pTxt->setValue((const char*)(pucEqualSign + 1), ucValueLength)));
                        }
                        else {
                            DEBUG_EX_ERR(DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRAnswerTXT: INVALID TXT format (No '=')!\n")););
                        }
                        pucCursor += ucLength;
                    }
                    else {  // no/zero length TXT
                        DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRAnswerTXT: TXT answer contains no items.\n")););
                        bResult = true;
                    }
                    
                    if ((bResult) &&
                        (pTxt)) {   // Everythings fine so far
                        // Link TXT item to answer TXTs
                        pTxt->m_pNext = p_rRRAnswerTXT.m_Txts.m_pTxts;
                        p_rRRAnswerTXT.m_Txts.m_pTxts = pTxt;
                    }
                    else {          // At least no TXT (migth be OK, if length was 0) OR an error
                        if (!bResult) {
                            DEBUG_EX_ERR(
                                    DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRAnswerTXT: FAILED to read TXT item!\n"));
                                    DEBUG_OUTPUT.printf(F("RData dump:\n"));
                                    _udpDump((m_pUDPContext->tell() - p_u16RDLength), p_u16RDLength);
                                    DEBUG_OUTPUT.printf(F("\n"));
                            );
                        }
                        if (pTxt) {
                            delete pTxt;
                            pTxt = 0;
                        }
                        p_rRRAnswerTXT.clear();
                    }
                }   // while
                
                DEBUG_EX_ERR(
                    if (!bResult) { // Some failure
                        DEBUG_OUTPUT.printf(F("RData dump:\n"));
                        _udpDump((m_pUDPContext->tell() - p_u16RDLength), p_u16RDLength);
                        DEBUG_OUTPUT.printf(F("\n"));
                    }
                );
            }
            else {
                DEBUG_EX_ERR(DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRAnswerTXT: FAILED to read TXT content!\n")););
            }
            // Clean up
            delete[] pucBuffer;
        }
        else {
            DEBUG_EX_ERR(DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRAnswerTXT: FAILED to alloc buffer for TXT content!\n")););
        }
    }
    else {
        DEBUG_EX_ERR(DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRAnswerTXT: WARNING! No content!\n")););
    }
    DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRAnswerTXT: FAILED!\n")););
    return bResult;
}

#ifdef MDNS_IP6_SUPPORT
    bool MDNSResponder::_readRRAnswerAAAA(MDNSResponder::stcMDNS_RRAnswerAAAA& p_rRRAnswerAAAA,
                                          uint16_t p_u16RDLength) {
        bool    bResult = false;
        // TODO: Implement
        return bResult;
    }
#endif

/*
 * MDNSResponder::_readRRAnswerSRV
 */
bool MDNSResponder::_readRRAnswerSRV(MDNSResponder::stcMDNS_RRAnswerSRV& p_rRRAnswerSRV,
                                     uint16_t p_u16RDLength) {
    
    bool    bResult = (((3 * sizeof(uint16_t)) < p_u16RDLength) &&
                       (_udpRead16(p_rRRAnswerSRV.m_u16Priority)) &&
                       (_udpRead16(p_rRRAnswerSRV.m_u16Weight)) &&
                       (_udpRead16(p_rRRAnswerSRV.m_u16Port)) &&
                       (_readRRDomain(p_rRRAnswerSRV.m_SRVDomain)));
    DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRAnswerSRV: FAILED!\n")););
    return bResult;
}

