LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Transfer.cpp
/*
 * MDNSResponder::_readRRAnswerGeneric
 */
bool MDNSResponder::_readRRAnswerGeneric(MDNSResponder::stcMDNS_RRAnswerGeneric& p_rRRAnswerGeneric,
                                         uint16_t p_u16RDLength) {
    bool    bResult = (0 == p_u16RDLength);
    
    p_rRRAnswerGeneric.clear();
    if (((p_rRRAnswerGeneric.m_u16RDLength = p_u16RDLength)) &&
        ((p_rRRAnswerGeneric.m_pu8RDData = new unsigned char[p_rRRAnswerGeneric.m_u16RDLength]))) {

        bResult = _udpReadBuffer(p_rRRAnswerGeneric.m_pu8RDData, p_rRRAnswerGeneric.m_u16RDLength);
    }
    DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRAnswerGeneric: FAILED!\n")););
    return bResult;
}

/*
 * MDNSResponder::_readRRHeader
 */
bool MDNSResponder::_readRRHeader(MDNSResponder::stcMDNS_RRHeader& p_rRRHeader) {
    //DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRHeader\n")););
    
    bool    bResult = ((_readRRDomain(p_rRRHeader.m_Domain)) &&
                       (_readRRAttributes(p_rRRHeader.m_Attributes)));
    DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRHeader: FAILED!\n")););
    return bResult;
}

/*
 * MDNSResponder::_readRRDomain
 *
 * Reads a (maybe multilevel compressed) domain from the UDP input buffer.
 *
 */
bool MDNSResponder::_readRRDomain(MDNSResponder::stcMDNS_RRDomain& p_rRRDomain) {
    //DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRDomain\n")););
    
    bool    bResult = ((p_rRRDomain.clear()) &&
                       (_readRRDomain_Loop(p_rRRDomain, 0)));
    DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRDomain: FAILED!\n")););
    return bResult;
}

/*
 * MDNSResponder::_readRRDomain_Loop
 *
 * Reads a domain from the UDP input buffer. For every compression level, the functions
 * calls itself recursively. To avoid endless recursion because of malformed MDNS records,
 * the maximum recursion depth is set by MDNS_DOMAIN_MAX_REDIRCTION.
 *
 */
bool MDNSResponder::_readRRDomain_Loop(MDNSResponder::stcMDNS_RRDomain& p_rRRDomain,
                                       uint8_t p_u8Depth) {
    //DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRDomain_Loop(%u)\n"), p_u8Depth););
    
    bool    bResult = false;
    
    if (MDNS_DOMAIN_MAX_REDIRCTION >= p_u8Depth) {
        bResult = true;
        
        uint8_t u8Len = 0;
        do {
            //DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRDomain_Loop(%u): Offset:%u p0:%02x\n"), p_u8Depth, m_pUDPContext->tell(), m_pUDPContext->peek()););
            _udpRead8(u8Len);
            
            if (u8Len & MDNS_DOMAIN_COMPRESS_MARK) {
                // Compressed label(s)
                uint16_t    u16Offset = ((u8Len & ~MDNS_DOMAIN_COMPRESS_MARK) << 8);    // Implicit BE to LE conversion!
                _udpRead8(u8Len);
                u16Offset |= u8Len;
                
                if (m_pUDPContext->isValidOffset(u16Offset)) {
                    size_t  stCurrentPosition = m_pUDPContext->tell();      // Prepare return from recursion
                    
                    //DEBUG_EX_RX(DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRDomain_Loop(%u): Redirecting from %u to %u!\n"), p_u8Depth, stCurrentPosition, u16Offset););
                    m_pUDPContext->seek(u16Offset);
                    if (_readRRDomain_Loop(p_rRRDomain, p_u8Depth + 1)) {   // Do recursion
                        //DEBUG_EX_RX(DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRDomain_Loop(%u): Succeeded to read redirected label! Returning to %u\n"), p_u8Depth, stCurrentPosition););
                        m_pUDPContext->seek(stCurrentPosition);             // Restore after recursion
                    }
                    else {
                        DEBUG_EX_ERR(DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRDomain_Loop(%u): FAILED to read redirected label!\n"), p_u8Depth););
                        bResult = false;
                    }
                }
                else {
                    DEBUG_EX_ERR(DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRDomain_Loop(%u): INVALID offset in redirection!\n"), p_u8Depth););
                    bResult = false;
                }
                break;
            }
            else {
                // Normal (uncompressed) label (maybe '\0' only)
                if (MDNS_DOMAIN_MAXLENGTH > (p_rRRDomain.m_u16NameLength + u8Len)) {
                    // Add length byte
                    p_rRRDomain.m_acName[p_rRRDomain.m_u16NameLength] = u8Len;
                    ++(p_rRRDomain.m_u16NameLength);
                    if (u8Len) {    // Add name
                        if ((bResult = _udpReadBuffer((unsigned char*)&(p_rRRDomain.m_acName[p_rRRDomain.m_u16NameLength]), u8Len))) {
                            /*DEBUG_EX_INFO(
                                    p_rRRDomain.m_acName[p_rRRDomain.m_u16NameLength + u8Len] = 0;  // Closing '\0' for printing
                                    DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRDomain_Loop(%u): Domain label (%u): %s\n"), p_u8Depth, (unsigned)(p_rRRDomain.m_acName[p_rRRDomain.m_u16NameLength - 1]), &(p_rRRDomain.m_acName[p_rRRDomain.m_u16NameLength]));
                                    );*/

                            p_rRRDomain.m_u16NameLength += u8Len;
                        }
                    }
                    //DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRDomain_Loop(2) offset:%u p0:%x\n"), m_pUDPContext->tell(), m_pUDPContext->peek()););
                }
                else {
                    DEBUG_EX_ERR(DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRDomain_Loop(%u): ERROR! Domain name too long (%u + %u)!\n"), p_u8Depth, p_rRRDomain.m_u16NameLength, u8Len););
                    bResult = false;
                    break;
                }
            }
        } while ((bResult) &&
                 (0 != u8Len));
    }
    else {
        DEBUG_EX_ERR(DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRDomain_Loop(%u): ERROR! Too many redirections!\n"), p_u8Depth););
    }
    return bResult;
}

