LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Transfer.cpp
/*
 * MDNSResponder::_readRRAttributes
 */
bool MDNSResponder::_readRRAttributes(MDNSResponder::stcMDNS_RRAttributes& p_rRRAttributes) {
    //DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRAttributes\n")););

    bool    bResult = ((_udpRead16(p_rRRAttributes.m_u16Type)) &&
                       (_udpRead16(p_rRRAttributes.m_u16Class)));
    DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _readRRAttributes: FAILED!\n")););
    return bResult;
}


/*
 * DOMAIN NAMES
 */

/*
 * MDNSResponder::_buildDomainForHost
 *
 * Builds a MDNS host domain (eg. esp8266.local) for the given hostname.
 *
 */
bool MDNSResponder::_buildDomainForHost(const char* p_pcHostname,
                                        MDNSResponder::stcMDNS_RRDomain& p_rHostDomain) const {
    
    p_rHostDomain.clear();
    bool    bResult = ((p_pcHostname) &&
                       (*p_pcHostname) &&
                       (p_rHostDomain.addLabel(p_pcHostname)) &&
                       (p_rHostDomain.addLabel(scpcLocal)) &&
                       (p_rHostDomain.addLabel(0)));
    DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _buildDomainForHost: FAILED!\n")););
    return bResult;
}

/*
 * MDNSResponder::_buildDomainForDNSSD
 *
 * Builds the '_services._dns-sd._udp.local' domain.
 * Used while detecting generic service enum question (DNS-SD) and answering these questions.
 *
 */
bool MDNSResponder::_buildDomainForDNSSD(MDNSResponder::stcMDNS_RRDomain& p_rDNSSDDomain) const {
    
    p_rDNSSDDomain.clear();
    bool    bResult = ((p_rDNSSDDomain.addLabel(scpcServices, true)) &&
                       (p_rDNSSDDomain.addLabel(scpcDNSSD, true)) &&
                       (p_rDNSSDDomain.addLabel(scpcUDP, true)) &&
                       (p_rDNSSDDomain.addLabel(scpcLocal)) &&
                       (p_rDNSSDDomain.addLabel(0)));
    DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _buildDomainForDNSSD: FAILED!\n")););
    return bResult;
}

/*
 * MDNSResponder::_buildDomainForService
 *
 * Builds the domain for the given service (eg. _http._tcp.local or
 * MyESP._http._tcp.local (if p_bIncludeName is set)).
 *
 */
bool MDNSResponder::_buildDomainForService(const MDNSResponder::stcMDNSService& p_Service,
                                           bool p_bIncludeName,
                                           MDNSResponder::stcMDNS_RRDomain& p_rServiceDomain) const {
    
    p_rServiceDomain.clear();
    bool    bResult = (((!p_bIncludeName) ||
                        (p_rServiceDomain.addLabel(p_Service.m_pcName))) &&
                       (p_rServiceDomain.addLabel(p_Service.m_pcService, true)) &&
                       (p_rServiceDomain.addLabel(p_Service.m_pcProtocol, true)) &&
                       (p_rServiceDomain.addLabel(scpcLocal)) &&
                       (p_rServiceDomain.addLabel(0)));
    DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _buildDomainForService: FAILED!\n")););
    return bResult;
}

/*
 * MDNSResponder::_buildDomainForService
 *
 * Builds the domain for the given service properties (eg. _http._tcp.local).
 * The usual prepended '_' are added, if missing in the input strings.
 *
 */
bool MDNSResponder::_buildDomainForService(const char* p_pcService,
                                           const char* p_pcProtocol,
                                           MDNSResponder::stcMDNS_RRDomain& p_rServiceDomain) const {
    
    p_rServiceDomain.clear();
    bool    bResult = ((p_pcService) &&
                       (p_pcProtocol) &&
                       (p_rServiceDomain.addLabel(p_pcService, ('_' != *p_pcService))) &&
                       (p_rServiceDomain.addLabel(p_pcProtocol, ('_' != *p_pcProtocol))) &&
                       (p_rServiceDomain.addLabel(scpcLocal)) &&
                       (p_rServiceDomain.addLabel(0)));
    DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _buildDomainForService: FAILED for (%s.%s)!\n"), (p_pcService ?: "-"), (p_pcProtocol ?: "-")););
    return bResult;
}           

#ifdef MDNS_IP4_SUPPORT
    /*
     * MDNSResponder::_buildDomainForReverseIP4
     *
     * The IP4 address is stringized by printing the four address bytes into a char buffer in reverse order
     * and adding 'in-addr.arpa' (eg. 012.789.456.123.in-addr.arpa).
     * Used while detecting reverse IP4 questions and answering these
     */
    bool MDNSResponder::_buildDomainForReverseIP4(IPAddress p_IP4Address,
                                                  MDNSResponder::stcMDNS_RRDomain& p_rReverseIP4Domain) const {
        
        bool    bResult = true;
        
        p_rReverseIP4Domain.clear();

        char    acBuffer[32];
        for (int i=MDNS_IP4_SIZE; ((bResult) && (i>=1)); --i) {
            itoa(p_IP4Address[i - 1], acBuffer, 10);
            bResult = p_rReverseIP4Domain.addLabel(acBuffer);
        }
        bResult = ((bResult) &&
                   (p_rReverseIP4Domain.addLabel(scpcReverseIP4Domain)) &&
                   (p_rReverseIP4Domain.addLabel(scpcReverseTopDomain)) &&
                   (p_rReverseIP4Domain.addLabel(0)));
        DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf(F("[MDNSResponder] _buildDomainForReverseIP4: FAILED!\n")););
        return bResult;
    }
#endif

#ifdef MDNS_IP6_SUPPORT
    /*
     * MDNSResponder::_buildDomainForReverseIP6
     *
     * Used while detecting reverse IP6 questions and answering these
     */
    bool MDNSResponder::_buildDomainForReverseIP6(IPAddress p_IP4Address,
                                                  MDNSResponder::stcMDNS_RRDomain& p_rReverseIP6Domain) const {
        // TODO: Implement
        return false;
    }
#endif


/*
 * UDP
 */

/*
 * MDNSResponder::_udpReadBuffer
 */
bool MDNSResponder::_udpReadBuffer(unsigned char* p_pBuffer,
                                   size_t p_stLength) {
    
    bool    bResult = ((m_pUDPContext) &&
                       (true/*m_pUDPContext->getSize() > p_stLength*/) &&
                       (p_pBuffer) &&
                       (p_stLength) &&
                       ((p_stLength == m_pUDPContext->read((char*)p_pBuffer, p_stLength))));
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _udpReadBuffer: FAILED!\n")); });
    return bResult;
}

