LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Transfer.cpp
/*
 * MDNSResponder::_udpRead8
 */
bool MDNSResponder::_udpRead8(uint8_t& p_ru8Value) {
    
   return _udpReadBuffer((unsigned char*)&p_ru8Value, sizeof(p_ru8Value));
}

/*
 * MDNSResponder::_udpRead16
 */
bool MDNSResponder::_udpRead16(uint16_t& p_ru16Value) {
    
    bool    bResult = false;

    if (_udpReadBuffer((unsigned char*)&p_ru16Value, sizeof(p_ru16Value))) {
        p_ru16Value = ntohs(p_ru16Value);
        bResult = true;
    }
    return bResult;
}

/*
 * MDNSResponder::_udpRead32
 */
bool MDNSResponder::_udpRead32(uint32_t& p_ru32Value) {
    
    bool    bResult = false;

    if (_udpReadBuffer((unsigned char*)&p_ru32Value, sizeof(p_ru32Value))) {
        p_ru32Value = ntohl(p_ru32Value);
        bResult = true;
    }
    return bResult;
}

/*
 * MDNSResponder::_udpAppendBuffer
 */
bool MDNSResponder::_udpAppendBuffer(const unsigned char* p_pcBuffer,
                                    size_t p_stLength) {
  
   bool bResult = ((m_pUDPContext) &&
                   (p_pcBuffer) &&
                   (p_stLength) &&
                   (p_stLength == m_pUDPContext->append((const char*)p_pcBuffer, p_stLength)));
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _udpAppendBuffer: FAILED!\n")); });
    return bResult;
}

/*
 * MDNSResponder::_udpAppend8
 */
bool MDNSResponder::_udpAppend8(uint8_t p_u8Value) {
    
    return (_udpAppendBuffer((unsigned char*)&p_u8Value, sizeof(p_u8Value)));
}

/*
 * MDNSResponder::_udpAppend16
 */
bool MDNSResponder::_udpAppend16(uint16_t p_u16Value) {
    
    p_u16Value = htons(p_u16Value);
    return (_udpAppendBuffer((unsigned char*)&p_u16Value, sizeof(p_u16Value)));
}

/*
 * MDNSResponder::_udpAppend32
 */
bool MDNSResponder::_udpAppend32(uint32_t p_u32Value) {
    
    p_u32Value = htonl(p_u32Value);
    return (_udpAppendBuffer((unsigned char*)&p_u32Value, sizeof(p_u32Value)));
}

#ifdef DEBUG_ESP_MDNS_RESPONDER
    /*
     * MDNSResponder::_udpDump
     */
    bool MDNSResponder::_udpDump(bool p_bMovePointer /*= false*/) {
        
        const uint8_t   cu8BytesPerLine = 16;
        
        uint32_t        u32StartPosition = m_pUDPContext->tell();
        DEBUG_OUTPUT.println("UDP Context Dump:");
        uint32_t    u32Counter = 0;
        uint8_t     u8Byte = 0;

        while (_udpRead8(u8Byte)) {
            DEBUG_OUTPUT.printf(F("%02x %s"), u8Byte, ((++u32Counter % cu8BytesPerLine) ? "" : "\n"));
        }
        DEBUG_OUTPUT.printf(F("%sDone: %u bytes\n"), (((u32Counter) && (u32Counter % cu8BytesPerLine)) ? "\n" : ""), u32Counter);
        
        if (!p_bMovePointer) {  // Restore
            m_pUDPContext->seek(u32StartPosition);
        }
        return true;
    }

    /*
     * MDNSResponder::_udpDump
     */
    bool MDNSResponder::_udpDump(unsigned p_uOffset,
                                 unsigned p_uLength) {

        if ((m_pUDPContext) &&
            (m_pUDPContext->isValidOffset(p_uOffset))) {
            unsigned    uCurrentPosition = m_pUDPContext->tell();   // Remember start position

            m_pUDPContext->seek(p_uOffset);
            uint8_t u8Byte;
            for (unsigned u=0; ((u<p_uLength) && (_udpRead8(u8Byte))); ++u) {
                DEBUG_OUTPUT.printf(F("%02x "), u8Byte);
            }
            // Return to start position
            m_pUDPContext->seek(uCurrentPosition);
        }
        return true;
    }
#endif


/**
 * READ/WRITE MDNS STRUCTS
 */

/*
 * MDNSResponder::_readMDNSMsgHeader
 *
 * Read a MDNS header from the UDP input buffer.
 *   |   8    |   8    |   8    |   8    |
 * 00|   Identifier    |  Flags & Codes  |
 * 01| Question count  |  Answer count   |
 * 02| NS answer count | Ad answer count |
 *
 * All 16-bit and 32-bit elements need to be translated form network coding to host coding (done in _udpRead16 and _udpRead32)
 * In addition, bitfield memory order is undefined in C standard (GCC doesn't order them in the coded direction...), so they
 * need some mapping here
 */
bool MDNSResponder::_readMDNSMsgHeader(MDNSResponder::stcMDNS_MsgHeader& p_rMsgHeader) {

    bool    bResult = false;

    uint8_t u8B1;
    uint8_t u8B2;
    if ((_udpRead16(p_rMsgHeader.m_u16ID)) &&
        (_udpRead8(u8B1))&&
        (_udpRead8(u8B2)) &&
        (_udpRead16(p_rMsgHeader.m_u16QDCount)) &&
        (_udpRead16(p_rMsgHeader.m_u16ANCount)) &&
        (_udpRead16(p_rMsgHeader.m_u16NSCount)) &&
        (_udpRead16(p_rMsgHeader.m_u16ARCount))) {

        p_rMsgHeader.m_1bQR     = (u8B1 & 0x80);    // Query/Responde flag
        p_rMsgHeader.m_4bOpcode = (u8B1 & 0x78);    // Operation code (0: Standard query, others ignored)
        p_rMsgHeader.m_1bAA     = (u8B1 & 0x04);    // Authorative answer
        p_rMsgHeader.m_1bTC     = (u8B1 & 0x02);    // Truncation flag
        p_rMsgHeader.m_1bRD     = (u8B1 & 0x01);    // Recursion desired

        p_rMsgHeader.m_1bRA     = (u8B2 & 0x80);    // Recursion available
        p_rMsgHeader.m_3bZ      = (u8B2 & 0x70);    // Zero
        p_rMsgHeader.m_4bRCode  = (u8B2 & 0x0F);    // Response code

        /*DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _readMDNSMsgHeader: ID:%u QR:%u OP:%u AA:%u TC:%u RD:%u RA:%u R:%u QD:%u AN:%u NS:%u AR:%u\n"),
                (unsigned)p_rMsgHeader.m_u16ID,
                (unsigned)p_rMsgHeader.m_1bQR, (unsigned)p_rMsgHeader.m_4bOpcode, (unsigned)p_rMsgHeader.m_1bAA, (unsigned)p_rMsgHeader.m_1bTC, (unsigned)p_rMsgHeader.m_1bRD,
                (unsigned)p_rMsgHeader.m_1bRA, (unsigned)p_rMsgHeader.m_4bRCode,
                (unsigned)p_rMsgHeader.m_u16QDCount,
                (unsigned)p_rMsgHeader.m_u16ANCount,
                (unsigned)p_rMsgHeader.m_u16NSCount,
                (unsigned)p_rMsgHeader.m_u16ARCount););*/
        bResult = true;
    }
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _readMDNSMsgHeader: FAILED!\n")); } );    
    return bResult;
}

/*
 * MDNSResponder::_write8
 */
bool MDNSResponder::_write8(uint8_t p_u8Value,
                            MDNSResponder::stcMDNSSendParameter& p_rSendParameter) {
    
    return ((_udpAppend8(p_u8Value)) &&
            (p_rSendParameter.shiftOffset(sizeof(p_u8Value))));
}

