LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Transfer.cpp
/*
 * MDNSResponder::_write16
 */
bool MDNSResponder::_write16(uint16_t p_u16Value,
                             MDNSResponder::stcMDNSSendParameter& p_rSendParameter) {
    
    return ((_udpAppend16(p_u16Value)) &&
            (p_rSendParameter.shiftOffset(sizeof(p_u16Value))));
}

/*
 * MDNSResponder::_write32
 */
bool MDNSResponder::_write32(uint32_t p_u32Value,
                             MDNSResponder::stcMDNSSendParameter& p_rSendParameter) {
    
    return ((_udpAppend32(p_u32Value)) &&
            (p_rSendParameter.shiftOffset(sizeof(p_u32Value))));
}

/*
 * MDNSResponder::_writeMDNSMsgHeader
 *
 * Write MDNS header to the UDP output buffer.
 *
 * All 16-bit and 32-bit elements need to be translated form host coding to network coding (done in _udpAppend16 and _udpAppend32)
 * In addition, bitfield memory order is undefined in C standard (GCC doesn't order them in the coded direction...), so they
 * need some mapping here
 */
bool MDNSResponder::_writeMDNSMsgHeader(const MDNSResponder::stcMDNS_MsgHeader& p_MsgHeader,
                                        MDNSResponder::stcMDNSSendParameter& p_rSendParameter) {
    /*DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSMsgHeader: ID:%u QR:%u OP:%u AA:%u TC:%u RD:%u RA:%u R:%u QD:%u AN:%u NS:%u AR:%u\n"),
            (unsigned)p_MsgHeader.m_u16ID,
            (unsigned)p_MsgHeader.m_1bQR, (unsigned)p_MsgHeader.m_4bOpcode, (unsigned)p_MsgHeader.m_1bAA, (unsigned)p_MsgHeader.m_1bTC, (unsigned)p_MsgHeader.m_1bRD,
            (unsigned)p_MsgHeader.m_1bRA, (unsigned)p_MsgHeader.m_4bRCode,
            (unsigned)p_MsgHeader.m_u16QDCount,
            (unsigned)p_MsgHeader.m_u16ANCount,
            (unsigned)p_MsgHeader.m_u16NSCount,
            (unsigned)p_MsgHeader.m_u16ARCount););*/

    uint8_t u8B1((p_MsgHeader.m_1bQR << 7) | (p_MsgHeader.m_4bOpcode << 3) | (p_MsgHeader.m_1bAA << 2) | (p_MsgHeader.m_1bTC << 1) | (p_MsgHeader.m_1bRD));
    uint8_t u8B2((p_MsgHeader.m_1bRA << 7) | (p_MsgHeader.m_3bZ << 4) | (p_MsgHeader.m_4bRCode));
    bool    bResult = ((_write16(p_MsgHeader.m_u16ID, p_rSendParameter)) &&
                       (_write8(u8B1, p_rSendParameter)) &&
                       (_write8(u8B2, p_rSendParameter)) &&
                       (_write16(p_MsgHeader.m_u16QDCount, p_rSendParameter)) &&
                       (_write16(p_MsgHeader.m_u16ANCount, p_rSendParameter)) &&
                       (_write16(p_MsgHeader.m_u16NSCount, p_rSendParameter)) &&
                       (_write16(p_MsgHeader.m_u16ARCount, p_rSendParameter)));

    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSMsgHeader: FAILED!\n")); });
    return bResult;
}

/*
 * MDNSResponder::_writeRRAttributes
 */
bool MDNSResponder::_writeMDNSRRAttributes(const MDNSResponder::stcMDNS_RRAttributes& p_Attributes,
                                           MDNSResponder::stcMDNSSendParameter& p_rSendParameter) {

    bool    bResult = ((_write16(p_Attributes.m_u16Type, p_rSendParameter)) &&
                       (_write16(p_Attributes.m_u16Class, p_rSendParameter)));

    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSRRAttributes: FAILED!\n")); });
    return bResult;
}

/*
 * MDNSResponder::_writeMDNSRRDomain
 */
bool MDNSResponder::_writeMDNSRRDomain(const MDNSResponder::stcMDNS_RRDomain& p_Domain,
                                     MDNSResponder::stcMDNSSendParameter& p_rSendParameter) {
    
    bool    bResult = ((_udpAppendBuffer((const unsigned char*)p_Domain.m_acName, p_Domain.m_u16NameLength)) &&
                       (p_rSendParameter.shiftOffset(p_Domain.m_u16NameLength)));

    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSRRDomain: FAILED!\n")); });
    return bResult;
}

/*
 * MDNSResponder::_writeMDNSHostDomain
 *
 * Write a host domain to the UDP output buffer.
 * If the domain record is part of the answer, the records length is
 * prepended (p_bPrependRDLength is set).
 *
 * A very simple form of name compression is applied here:
 * If the domain is written to the UDP output buffer, the write offset is stored
 * together with a domain id (the pointer) in a p_rSendParameter substructure (cache).
 * If the same domain (pointer) should be written to the UDP output later again,
 * the old offset is retrieved from the cache, marked as a compressed domain offset
 * and written to the output buffer.
 *
 */
bool MDNSResponder::_writeMDNSHostDomain(const char* p_pcHostname,
                                         bool p_bPrependRDLength,
                                         MDNSResponder::stcMDNSSendParameter& p_rSendParameter) {

    // The 'skip-compression' version is handled in '_writeMDNSAnswer_SRV'
    uint16_t            u16CachedDomainOffset = p_rSendParameter.findCachedDomainOffset((const void*)p_pcHostname, false);

    stcMDNS_RRDomain    hostDomain;
    bool    bResult = (u16CachedDomainOffset
                        // Found cached domain -> mark as compressed domain
                        ? ((MDNS_DOMAIN_COMPRESS_MARK > ((u16CachedDomainOffset >> 8) & ~MDNS_DOMAIN_COMPRESS_MARK)) && // Valid offset
                           ((!p_bPrependRDLength) ||
                            (_write16(2, p_rSendParameter))) &&                                     // Length of 'Cxxx'
                           (_write8(((u16CachedDomainOffset >> 8) | MDNS_DOMAIN_COMPRESS_MARK), p_rSendParameter)) &&   // Compression mark (and offset)
                           (_write8((uint8_t)(u16CachedDomainOffset & 0xFF), p_rSendParameter)))
                        // No cached domain -> add this domain to cache and write full domain name
                        : ((_buildDomainForHost(p_pcHostname, hostDomain)) &&                       // eg. esp8266.local
                           ((!p_bPrependRDLength) ||
                            (_write16(hostDomain.m_u16NameLength, p_rSendParameter))) &&            // RDLength (if needed)
                           (p_rSendParameter.addDomainCacheItem((const void*)p_pcHostname, false, p_rSendParameter.m_u16Offset)) &&
                           (_writeMDNSRRDomain(hostDomain, p_rSendParameter))));

    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSHostDomain: FAILED!\n")); });
    return bResult;

