LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Transfer.cpp
}

/*
 * MDNSResponder::_writeMDNSServiceDomain
 *
 * Write a service domain to the UDP output buffer.
 * If the domain record is part of the answer, the records length is
 * prepended (p_bPrependRDLength is set).
 *
 * A very simple form of name compression is applied here: see '_writeMDNSHostDomain'
 * The cache differentiates of course between service domains which includes
 * the instance name (p_bIncludeName is set) and thoose who don't.
 *
 */
bool MDNSResponder::_writeMDNSServiceDomain(const MDNSResponder::stcMDNSService& p_Service,
                                            bool p_bIncludeName,
                                            bool p_bPrependRDLength,
                                            MDNSResponder::stcMDNSSendParameter& p_rSendParameter) {

    // The 'skip-compression' version is handled in '_writeMDNSAnswer_SRV'
    uint16_t            u16CachedDomainOffset = p_rSendParameter.findCachedDomainOffset((const void*)&p_Service, p_bIncludeName);

    stcMDNS_RRDomain    serviceDomain;
    bool    bResult = (u16CachedDomainOffset
                        // Found cached domain -> mark as compressed domain
                        ? ((MDNS_DOMAIN_COMPRESS_MARK > ((u16CachedDomainOffset >> 8) & ~MDNS_DOMAIN_COMPRESS_MARK)) && // Valid offset
                           ((!p_bPrependRDLength) ||
                            (_write16(2, p_rSendParameter))) &&                                     // Lenght of 'Cxxx'
                           (_write8(((u16CachedDomainOffset >> 8) | MDNS_DOMAIN_COMPRESS_MARK), p_rSendParameter)) &&   // Compression mark (and offset)
                           (_write8((uint8_t)(u16CachedDomainOffset & 0xFF), p_rSendParameter)))
                        // No cached domain -> add this domain to cache and write full domain name
                        : ((_buildDomainForService(p_Service, p_bIncludeName, serviceDomain)) &&    // eg. MyESP._http._tcp.local
                           ((!p_bPrependRDLength) ||
                            (_write16(serviceDomain.m_u16NameLength, p_rSendParameter))) &&         // RDLength (if needed)
                           (p_rSendParameter.addDomainCacheItem((const void*)&p_Service, p_bIncludeName, p_rSendParameter.m_u16Offset)) &&
                           (_writeMDNSRRDomain(serviceDomain, p_rSendParameter))));

    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSServiceDomain: FAILED!\n")); });
    return bResult;

}

/*
 * MDNSResponder::_writeMDNSQuestion
 *
 * Write a MDNS question to the UDP output buffer
 *
 * QNAME  (host/service domain, eg. esp8266.local)
 * QTYPE  (16bit, eg. ANY)
 * QCLASS (16bit, eg. IN)
 *
 */
bool MDNSResponder::_writeMDNSQuestion(MDNSResponder::stcMDNS_RRQuestion& p_Question,
                                       MDNSResponder::stcMDNSSendParameter& p_rSendParameter) {
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSQuestion\n")););

    bool    bResult = ((_writeMDNSRRDomain(p_Question.m_Header.m_Domain, p_rSendParameter)) &&
                       (_writeMDNSRRAttributes(p_Question.m_Header.m_Attributes, p_rSendParameter)));

    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSQuestion: FAILED!\n")); });
    return bResult;

}


#ifdef MDNS_IP4_SUPPORT
    /*
     * MDNSResponder::_writeMDNSAnswer_A
     *
     * Write a MDNS A answer to the UDP output buffer.
     *
     * NAME     (var, host/service domain, eg. esp8266.local
     * TYPE     (16bit, eg. A)
     * CLASS    (16bit, eg. IN)
     * TTL      (32bit, eg. 120)
     * RDLENGTH (16bit, eg 4)
     * RDATA    (var, eg. 123.456.789.012)
     *
     * eg. esp8266.local A 0x8001 120 4 123.456.789.012
     * Ref: http://www.zytrax.com/books/dns/ch8/a.html
     */
    bool MDNSResponder::_writeMDNSAnswer_A(IPAddress p_IPAddress,
                                           MDNSResponder::stcMDNSSendParameter& p_rSendParameter) {
        DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSAnswer_A (%s)\n"), p_IPAddress.toString().c_str()););

        stcMDNS_RRAttributes    attributes(DNS_RRTYPE_A,
                                           ((p_rSendParameter.m_bCacheFlush ? 0x8000 : 0) | DNS_RRCLASS_IN));   // Cache flush? & INternet
        const unsigned char     aucIPAddress[MDNS_IP4_SIZE] = { p_IPAddress[0], p_IPAddress[1], p_IPAddress[2], p_IPAddress[3] };
        bool    bResult = ((_writeMDNSHostDomain(m_pcHostname, false, p_rSendParameter)) &&
                           (_writeMDNSRRAttributes(attributes, p_rSendParameter)) &&        // TYPE & CLASS
                           (_write32((p_rSendParameter.m_bUnannounce ? 0 : MDNS_HOST_TTL), p_rSendParameter)) &&    // TTL
                           (_write16(MDNS_IP4_SIZE, p_rSendParameter)) &&                   // RDLength
                           (_udpAppendBuffer(aucIPAddress, MDNS_IP4_SIZE)) &&               // RData
                           (p_rSendParameter.shiftOffset(MDNS_IP4_SIZE)));

        DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSAnswer_A: FAILED!\n")); });
        return bResult;

    }

    /*
     * MDNSResponder::_writeMDNSAnswer_PTR_IP4
     *
     * Write a MDNS reverse IP4 PTR answer to the UDP output buffer.
     * See: '_writeMDNSAnswer_A'
     *
     * eg. 012.789.456.123.in-addr.arpa PTR 0x8001 120 15 esp8266.local
     * Used while answering reverse IP4 questions
     */
    bool MDNSResponder::_writeMDNSAnswer_PTR_IP4(IPAddress p_IPAddress,
                                                 MDNSResponder::stcMDNSSendParameter& p_rSendParameter) {
        DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSAnswer_PTR_IP4 (%s)\n"), p_IPAddress.toString().c_str()););
        
        stcMDNS_RRDomain        reverseIP4Domain;
        stcMDNS_RRAttributes    attributes(DNS_RRTYPE_PTR,
                                           ((p_rSendParameter.m_bCacheFlush ? 0x8000 : 0) | DNS_RRCLASS_IN));   // Cache flush? & INternet
        stcMDNS_RRDomain        hostDomain;
        bool    bResult = ((_buildDomainForReverseIP4(p_IPAddress, reverseIP4Domain)) &&    // 012.789.456.123.in-addr.arpa
                           (_writeMDNSRRDomain(reverseIP4Domain, p_rSendParameter)) &&
                           (_writeMDNSRRAttributes(attributes, p_rSendParameter)) &&        // TYPE & CLASS
                           (_write32((p_rSendParameter.m_bUnannounce ? 0 : MDNS_HOST_TTL), p_rSendParameter)) &&    // TTL
                           (_writeMDNSHostDomain(m_pcHostname, true, p_rSendParameter)));   // RDLength & RData (host domain, eg. esp8266.local)

        DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSAnswer_PTR_IP4: FAILED!\n")); });
        return bResult;
    }
#endif

