LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Transfer.cpp
/*
 * MDNSResponder::_writeMDNSAnswer_PTR_TYPE
 *
 * Write a MDNS PTR answer to the UDP output buffer.
 * See: '_writeMDNSAnswer_A'
 *
 * PTR all-services -> service type
 * eg. _services._dns-sd._udp.local PTR 0x8001 5400 xx _http._tcp.local
 * http://www.zytrax.com/books/dns/ch8/ptr.html
 */
bool MDNSResponder::_writeMDNSAnswer_PTR_TYPE(MDNSResponder::stcMDNSService& p_rService,
                                              MDNSResponder::stcMDNSSendParameter& p_rSendParameter) {
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSAnswer_PTR_TYPE\n")););
    
    stcMDNS_RRDomain        dnssdDomain;
    stcMDNS_RRDomain        serviceDomain;
    stcMDNS_RRAttributes    attributes(DNS_RRTYPE_PTR,
                                       ((p_rSendParameter.m_bCacheFlush ? 0x8000 : 0) | DNS_RRCLASS_IN));   // Cache flush? & INternet
    bool    bResult = ((_buildDomainForDNSSD(dnssdDomain)) &&                                   // _services._dns-sd._udp.local
                       (_writeMDNSRRDomain(dnssdDomain, p_rSendParameter)) &&
                       (_writeMDNSRRAttributes(attributes, p_rSendParameter)) &&                // TYPE & CLASS
                       (_write32((p_rSendParameter.m_bUnannounce ? 0 : MDNS_SERVICE_TTL), p_rSendParameter)) && // TTL
                       (_writeMDNSServiceDomain(p_rService, false, true, p_rSendParameter)));   // RDLength & RData (service domain, eg. _http._tcp.local)

    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSAnswer_PTR_TYPE: FAILED!\n")); });
    return bResult;
}

/*
 * MDNSResponder::_writeMDNSAnswer_PTR_NAME
 *
 * Write a MDNS PTR answer to the UDP output buffer.
 * See: '_writeMDNSAnswer_A'
 *
 * PTR service type -> service name
 * eg. _http.tcp.local PTR 0x8001 120 xx myESP._http._tcp.local
 * http://www.zytrax.com/books/dns/ch8/ptr.html
 */ 
bool MDNSResponder::_writeMDNSAnswer_PTR_NAME(MDNSResponder::stcMDNSService& p_rService,
                                              MDNSResponder::stcMDNSSendParameter& p_rSendParameter) {
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSAnswer_PTR_NAME\n")););

    stcMDNS_RRAttributes    attributes(DNS_RRTYPE_PTR,
                                       ((p_rSendParameter.m_bCacheFlush ? 0x8000 : 0) | DNS_RRCLASS_IN));   // Cache flush? & INternet
    bool    bResult = ((_writeMDNSServiceDomain(p_rService, false, false, p_rSendParameter)) && // _http._tcp.local
                       (_writeMDNSRRAttributes(attributes, p_rSendParameter)) &&                    // TYPE & CLASS
                       (_write32((p_rSendParameter.m_bUnannounce ? 0 : MDNS_SERVICE_TTL), p_rSendParameter)) && // TTL
                       (_writeMDNSServiceDomain(p_rService, true, true, p_rSendParameter)));        // RDLength & RData (service domain, eg. MyESP._http._tcp.local)

    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSAnswer_PTR_NAME: FAILED!\n")); });
    return bResult;
}


/*
 * MDNSResponder::_writeMDNSAnswer_TXT
 *
 * Write a MDNS TXT answer to the UDP output buffer.
 * See: '_writeMDNSAnswer_A'
 *
 * The TXT items in the RDATA block are 'length byte encoded': [len]vardata
 *
 * eg. myESP._http._tcp.local TXT 0x8001 120 4 c#=1
 * http://www.zytrax.com/books/dns/ch8/txt.html
 */
bool MDNSResponder::_writeMDNSAnswer_TXT(MDNSResponder::stcMDNSService& p_rService,
                                         MDNSResponder::stcMDNSSendParameter& p_rSendParameter) {
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSAnswer_TXT\n")););
    
    bool                    bResult = false;

    stcMDNS_RRAttributes    attributes(DNS_RRTYPE_TXT,
                                       ((p_rSendParameter.m_bCacheFlush ? 0x8000 : 0) | DNS_RRCLASS_IN));   // Cache flush? & INternet
    
    if ((_collectServiceTxts(p_rService)) &&
        (_writeMDNSServiceDomain(p_rService, true, false, p_rSendParameter)) &&     // MyESP._http._tcp.local
        (_writeMDNSRRAttributes(attributes, p_rSendParameter)) &&                   // TYPE & CLASS
        (_write32((p_rSendParameter.m_bUnannounce ? 0 : MDNS_SERVICE_TTL), p_rSendParameter)) &&    // TTL
        (_write16(p_rService.m_Txts.length(), p_rSendParameter))) {                 // RDLength
        
        bResult = true;
        // RData    Txts
        for (stcMDNSServiceTxt* pTxt=p_rService.m_Txts.m_pTxts; ((bResult) && (pTxt)); pTxt = pTxt->m_pNext) {
            unsigned char       ucLengthByte = pTxt->length();
            bResult = ((_udpAppendBuffer((unsigned char*)&ucLengthByte, sizeof(ucLengthByte))) &&   // Length
                       (p_rSendParameter.shiftOffset(sizeof(ucLengthByte))) &&
                       ((size_t)os_strlen(pTxt->m_pcKey) == m_pUDPContext->append(pTxt->m_pcKey, os_strlen(pTxt->m_pcKey))) &&          // Key
                       (p_rSendParameter.shiftOffset((size_t)os_strlen(pTxt->m_pcKey))) &&
                       (1 == m_pUDPContext->append("=", 1)) &&                                                                          // =
                       (p_rSendParameter.shiftOffset(1)) &&
                       ((!pTxt->m_pcValue) ||
                        (((size_t)os_strlen(pTxt->m_pcValue) == m_pUDPContext->append(pTxt->m_pcValue, os_strlen(pTxt->m_pcValue))) &&  // Value
                         (p_rSendParameter.shiftOffset((size_t)os_strlen(pTxt->m_pcValue))))));

            DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSAnswer_TXT: FAILED to write %sTxt %s=%s!\n"), (pTxt->m_bTemp ? "temp. " : ""), (pTxt->m_pcKey ?: "?"), (pTxt->m_pcValue ?: "?")); });
        }
    }
    _releaseTempServiceTxts(p_rService);
    
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSAnswer_TXT: FAILED!\n")); });
    return bResult;
}

#ifdef MDNS_IP6_SUPPORT
    /*
     * MDNSResponder::_writeMDNSAnswer_AAAA
     *
     * Write a MDNS AAAA answer to the UDP output buffer.
     * See: '_writeMDNSAnswer_A'
     *
     * eg. esp8266.local AAAA 0x8001 120 16 xxxx::xx
     * http://www.zytrax.com/books/dns/ch8/aaaa.html
     */
    bool MDNSResponder::_writeMDNSAnswer_AAAA(IPAddress p_IPAddress,
                                              MDNSResponder::stcMDNSSendParameter& p_rSendParameter) {
        DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSAnswer_AAAA\n")););

        stcMDNS_RRAttributes    attributes(DNS_RRTYPE_AAAA,
                                           ((p_rSendParameter.m_bCacheFlush ? 0x8000 : 0) | DNS_RRCLASS_IN));   // Cache flush? & INternet
        bool    bResult = ((_writeMDNSHostDomain(m_pcHostname, false, p_rSendParameter)) && // esp8266.local
                           (_writeMDNSRRAttributes(attributes, p_rSendParameter)) &&            // TYPE & CLASS
                           (_write32((p_rSendParameter.m_bUnannounce ? 0 : MDNS_HOST_TTL), p_rSendParameter)) &&    // TTL
                           (_write16(MDNS_IP6_SIZE, p_rSendParameter)) &&                       // RDLength
                           (false /*TODO: IP6 version of: _udpAppendBuffer((uint32_t)p_IPAddress, MDNS_IP4_SIZE)*/));   // RData

        DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSAnswer_AAAA: FAILED!\n")); });
        return bResult;
    }
    
