LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Transfer.cpp
    /*
     * MDNSResponder::_writeMDNSAnswer_PTR_IP6
     *
     * Write a MDNS reverse IP6 PTR answer to the UDP output buffer.
     * See: '_writeMDNSAnswer_A'
     *
     * eg. xxxx::xx.in6.arpa PTR 0x8001 120 15 esp8266.local
     * Used while answering reverse IP6 questions
     */
    bool MDNSResponder::_writeMDNSAnswer_PTR_IP6(IPAddress p_IPAddress,
                                                 MDNSResponder::stcMDNSSendParameter& p_rSendParameter) {
        DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSAnswer_PTR_IP6\n")););
        
        stcMDNS_RRDomain        reverseIP6Domain;
        stcMDNS_RRAttributes    attributes(DNS_RRTYPE_PTR,
                                           ((p_rSendParameter.m_bCacheFlush ? 0x8000 : 0) | DNS_RRCLASS_IN));   // Cache flush? & INternet
        bool    bResult = ((_buildDomainForReverseIP6(p_IPAddress, reverseIP6Domain)) &&        // xxxx::xx.ip6.arpa
                           (_writeMDNSRRDomain(reverseIP6Domain, p_rSendParameter)) &&
                           (_writeMDNSRRAttributes(attributes, p_rSendParameter)) &&            // TYPE & CLASS
                           (_write32((p_rSendParameter.m_bUnannounce ? 0 : MDNS_HOST_TTL), p_rSendParameter)) &&    // TTL
                           (_writeMDNSHostDomain(m_pcHostname, true, p_rSendParameter)));       // RDLength & RData (host domain, eg. esp8266.local)

        DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSAnswer_PTR_IP6: FAILED!\n")); });
        return bResult;
    }
#endif

/*
 * MDNSResponder::_writeMDNSAnswer_SRV
 *
 * eg. MyESP._http.tcp.local SRV 0x8001 120 0 0 60068 esp8266.local
 * http://www.zytrax.com/books/dns/ch8/srv.html ???? Include instance name ????
 */
bool MDNSResponder::_writeMDNSAnswer_SRV(MDNSResponder::stcMDNSService& p_rService,
                                         MDNSResponder::stcMDNSSendParameter& p_rSendParameter) {
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSAnswer_SRV\n")););

    uint16_t                u16CachedDomainOffset = (p_rSendParameter.m_bLegacyQuery
                                                        ? 0
                                                        : p_rSendParameter.findCachedDomainOffset((const void*)m_pcHostname, false));

    stcMDNS_RRAttributes    attributes(DNS_RRTYPE_SRV,
                                       ((p_rSendParameter.m_bCacheFlush ? 0x8000 : 0) | DNS_RRCLASS_IN));   // Cache flush? & INternet
    stcMDNS_RRDomain        hostDomain;
    bool    bResult = ((_writeMDNSServiceDomain(p_rService, true, false, p_rSendParameter)) &&  // MyESP._http._tcp.local
                       (_writeMDNSRRAttributes(attributes, p_rSendParameter)) &&                // TYPE & CLASS
                       (_write32((p_rSendParameter.m_bUnannounce ? 0 : MDNS_SERVICE_TTL), p_rSendParameter)) && // TTL
                       (!u16CachedDomainOffset
                            // No cache for domain name (or no compression allowed)
                            ? ((_buildDomainForHost(m_pcHostname, hostDomain)) &&
                               (_write16((sizeof(uint16_t /*Prio*/) +                           // RDLength
                                          sizeof(uint16_t /*Weight*/) +
                                          sizeof(uint16_t /*Port*/) +
                                          hostDomain.m_u16NameLength), p_rSendParameter)) &&    // Domain length
                               (_write16(MDNS_SRV_PRIORITY, p_rSendParameter)) &&               // Priority
                               (_write16(MDNS_SRV_WEIGHT, p_rSendParameter)) &&                 // Weight
                               (_write16(p_rService.m_u16Port, p_rSendParameter)) &&            // Port
                               (p_rSendParameter.addDomainCacheItem((const void*)m_pcHostname, false, p_rSendParameter.m_u16Offset)) &&
                               (_writeMDNSRRDomain(hostDomain, p_rSendParameter)))              // Host, eg. esp8266.local
                            // Cache available for domain
                            : ((MDNS_DOMAIN_COMPRESS_MARK > ((u16CachedDomainOffset >> 8) & ~MDNS_DOMAIN_COMPRESS_MARK)) && // Valid offset
                               (_write16((sizeof(uint16_t /*Prio*/) +                           // RDLength
                                          sizeof(uint16_t /*Weight*/) +
                                          sizeof(uint16_t /*Port*/) +
                                          2), p_rSendParameter)) &&                             // Length of 'C0xx'
                               (_write16(MDNS_SRV_PRIORITY, p_rSendParameter)) &&               // Priority
                               (_write16(MDNS_SRV_WEIGHT, p_rSendParameter)) &&                 // Weight
                               (_write16(p_rService.m_u16Port, p_rSendParameter)) &&            // Port
                               (_write8(((u16CachedDomainOffset >> 8) | MDNS_DOMAIN_COMPRESS_MARK), p_rSendParameter)) &&   // Compression mark (and offset)
                               (_write8((uint8_t)u16CachedDomainOffset, p_rSendParameter)))));  // Offset

    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _writeMDNSAnswer_SRV: FAILED!\n")); });
    return bResult;
}

}   // namespace LEA_MDNSResponder






